# Продакт на главной mail.ru решил протестировать в рекомендательной ленте контента вместо карточек со статьями видеоплеер 
# с короткими видео. Нынешний таймспент на юзера в день в среднем равен 25 минут, а стандартная ошибка (SD) равна 156. 
# Мы предполагаем, что в новой версии таймспент на юзера в день изменится на 10%. 
# Средний трафик 20000 человек в день. Посчитайте сколько дней необходимо держать эксперимент при alpha = 5% и beta = 20% .

# Посчитала по калькулятору, нужное количество юзеров для каждой группы 61124, в общем 122248
# Средний трафик 20000 человек в день.
# 122248 / 20000 ~ 7 дней необходимо держать эксперимент


# Наша продуктовая команда в ecommerce магазине планирует запустить тест, направленный на ускорение загрузки сайта. 
# Одна из основных метрик bounce rate в GA = 40%. Мы предполагаем, что при оптимизации сайта она изменится минимум на 20%.
# Средний трафик 4000 человек в день.
# Посчитайте сколько нам нужно дней держать эксперимент при alpha = 5% и beta = 20%

# Посчитала по калькулятору, нужное количество юзеров для каждой группы 592, в общем 1184
# Средний трафик 4000 человек в день.
# 1184 / 4000 ~ 1 день необходимо держать эксперимент