# Случайная непрерывная величина A имеет равномерное распределение на промежутке (200, 800]. 
# Найдите ее среднее значение и дисперсию.

a = 200
b = 800

M_X = (a + b) / 2
print(M_X)
D_X = (b - a)**2/12
print(D_X)